app/controllers/movies_controller.rb

    def index
      @all_ratings = Movie.get_ratings
      @selectedRatings = params[:ratings]

      @sortTerm = params[:sortTerm]

      if @selectedRatings
        @movies = Movie.with_ratings(@selectedRatings.keys).order(@sortTerm)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13')  ORDER BY release_date